import pytest
from src.utils import filtering_dict

@pytest.fixture
def fixture_fil_dict():
    return [
  {
    "state": "EXECUTED",
    "date": "2022-08-26T10:50:58.294041",
    "from": "Maestro 1596837868705199",
    "to": "Счет 64686473678894779589"
  },
  {
    "state": "EXECUTED",
    "date": "2001-07-03T18:35:29.512364",
    "from": "MasterCard 7158300734726758",
    "to": "Счет 35383033474447895560"
  },
  {
    "state": "EXECUTED",
    "date": "2018-06-30T02:08:58.425572",
    "from": "Счет 75106830613657916952",
    "to": "Счет 11776614605963066702"
  },
  {
    "state": "EXECUTED",
    "date": "2023-04-04T23:20:05.206878",
    "from": "Счет 19708645243227258542",
    "to": "Счет 75651667383060284188"
  },
  {
    "state": "EXECUTED",
    "date": "2012-03-23T01:09:46.296404",
    "from": "Счет 44812258784861134719",
    "to": "Счет 74489636417521191160"
  },
  {
    "state": "EXECUTED",
    "date": "2018-12-20T16:43:26.929246",
    "from": "Счет 10848359769870775355",
    "to": "Счет 21969751544412966366"
  },
  {
    "state": "EXECUTED",
    "date": "2014-07-12T20:41:47.882230",
    "from": "Счет 48894435694657014368",
    "to": "Счет 38976430693692818358"
  }
]


def test_filtering_dict(fixture_fil_dict):
    assert filtering_dict(fixture_fil_dict) == [
        {'state': 'EXECUTED',
         'date': '2023-04-04T23:20:05.206878',
         'from': 'Счет 19708645243227258542',
         'to': 'Счет 75651667383060284188'},
        {'state': 'EXECUTED',
         'date': '2022-08-26T10:50:58.294041',
         'from': 'Maestro 1596837868705199',
         'to': 'Счет 64686473678894779589'},
        {'state': 'EXECUTED',
         'date': '2018-12-20T16:43:26.929246',
         'from': 'Счет 10848359769870775355',
         'to': 'Счет 21969751544412966366'},
        {'state': 'EXECUTED',
         'date': '2018-06-30T02:08:58.425572',
         'from': 'Счет 75106830613657916952',
         'to': 'Счет 11776614605963066702'},
        {'state': 'EXECUTED',
         'date': '2014-07-12T20:41:47.882230',
         'from': 'Счет 48894435694657014368',
         'to': 'Счет 38976430693692818358'}]


